In [2]:
import pandas as pd
file_path = r"C:\Users\Sivaraman\Desktop\study\data analytics\Data (for practice)\bank_details_withdate.xlsx"
df = pd.read_excel(file_path)
print(df)

     CustomerId        Name  CreditScore  Country  Gender  Age  Tenure  \
0      15634602    Hargrave          619   France  Female   42       2
1      15634602    Hargrave          619   France  Female   42       2
2      15634602        Onio          502   France  Female   42       8
3      15634602        Onio          502   France  Female   42       8
4      15737888    Mitchell          850    Spain  Female   43       2
..          ...         ...          ...      ...     ...  ...     ...
448    15694860    Uspensky          675   France  Female   38       6
449    15658169        Cook          778    Spain  Female   47       6
450    15794396     Newbold          494  Germany  Female   38       7
451    15785798  Uchechukwu          850   France    Male   40       9
452    15710825       Ch'en          592    Spain    Male   31       7

       Balance  NumOfProducts     Salary       Date      Dep
0         0.00              1  101348.88 2023-01-01     Bank
1         0.00              1  101348.88 2023-01-02     Bank
2    159660.80              3  112542.58 2023-01-03     Bank
3    159660.80              3  112542.58 2023-01-04     Bank
4    125510.82              1   79084.10 2023-01-05     Bank
..         ...            ...        ...        ...      ...
448   68065.80              1  138777.00 2025-01-31  Entrepr
449  127299.34              2  124694.99 2025-01-31  Entrepr
450  174937.64              1   40084.32 2025-01-31  Entrepr
451       0.00              2  119232.33 2025-01-31  Entrepr
452  110071.10              1   43921.36 2025-01-31  Entrepr

[453 rows x 12 columns]

In [4]:
'''pivot_df = df.pivot(index='CustomerId', columns='Date', values='Balance')
print(pivot_df)'''

pivot_df = df.pivot(index = 'CustomerId', columns = 'Date', values = 'Balance')
print(pivot_df)

Date        2023-01-01  2023-01-02  2023-01-03  2023-01-04  2023-01-05  \
CustomerId
15566111           NaN         NaN         NaN         NaN         NaN
15566594           NaN         NaN         NaN         NaN         NaN
15568240           NaN         NaN         NaN         NaN         NaN
15568748           NaN         NaN         NaN         NaN         NaN
15568982           NaN         NaN         NaN         NaN         NaN
...                ...         ...         ...         ...         ...
15812191           NaN         NaN         NaN         NaN         NaN
15812518           NaN         NaN         NaN         NaN         NaN
15812878           NaN         NaN         NaN         NaN         NaN
15813163           NaN         NaN         NaN         NaN         NaN
15813844           NaN         NaN         NaN         NaN         NaN

Date        2023-01-06  2023-01-07  2023-01-08  2023-01-09  2023-01-10  ...  \
CustomerId                                                              ...
15566111           NaN         NaN         NaN         NaN         NaN  ...
15566594           NaN         NaN         NaN         NaN         NaN  ...
15568240           NaN         NaN         NaN         NaN         NaN  ...
15568748           NaN         NaN         NaN         NaN         NaN  ...
15568982           NaN         NaN         NaN         NaN         NaN  ...
...                ...         ...         ...         ...         ...  ...
15812191           NaN         NaN         NaN         NaN         NaN  ...
15812518           NaN         NaN         NaN         NaN         NaN  ...
15812878           NaN         NaN         NaN         NaN         NaN  ...
15813163           NaN         NaN         NaN         NaN         NaN  ...
15813844           NaN         NaN         NaN         NaN         NaN  ...

Date        2025-01-22  2025-01-23  2025-01-24  2025-01-25  2025-01-26  \
CustomerId
15566111           NaN         NaN         NaN         NaN         NaN
15566594           NaN         NaN         NaN         NaN         NaN
15568240           NaN         NaN         NaN         NaN         NaN
15568748           NaN         NaN         NaN         NaN         NaN
15568982           NaN         NaN         NaN         NaN         NaN
...                ...         ...         ...         ...         ...
15812191           NaN         NaN         NaN         NaN         NaN
15812518           NaN         NaN         NaN         NaN         NaN
15812878           NaN         NaN         NaN         NaN         NaN
15813163           NaN         NaN         NaN         NaN         NaN
15813844           NaN         NaN         NaN         NaN         NaN

Date        2025-01-27  2025-01-28  2025-01-29  2025-01-30  2025-01-31
CustomerId
15566111           NaN         NaN         NaN         NaN         NaN
15566594           NaN         NaN         NaN         NaN         NaN
15568240           NaN         NaN         NaN         NaN         NaN
15568748           NaN         NaN         NaN         NaN         NaN
15568982           NaN         NaN         NaN         NaN         NaN
...                ...         ...         ...         ...         ...
15812191           NaN         NaN         NaN         NaN         NaN
15812518           NaN         NaN         NaN         NaN         NaN
15812878           NaN         NaN         NaN         NaN         NaN
15813163           NaN         NaN         NaN         NaN         NaN
15813844           NaN         NaN         NaN         NaN         NaN

[437 rows x 427 columns]

In [5]:
print(df['Date'].dtypes)

datetime64[ns]

In [6]:
#1Ô∏è‚É£ Pivot Table on a Single Column
#Find the average CreditScore for each Country
'''pivot1 = df.pivot_table(values="CreditScore", index="Country", aggfunc="mean")
print(pivot1)
'''
pivot1 = df.pivot_table(values ='CreditScore', index = 'Country', aggfunc = 'mean')
print(pivot1)

         CreditScore
Country
France    647.673367
Germany   648.076336
Spain     646.747967

In [7]:
#2Ô∏è‚É£ Multiple Aggregations in Pivot Table
#Find the average Salary and Balance per Country
'''pivot2 = df.pivot_table(values=["Salary", "Balance"], index="Country", aggfunc="mean")
print(pivot2)
'''
pivot2 = df.pivot_table(values = ['Salary', 'Balance'], index = 'Country', aggfunc = 'mean')
print(pivot2)

               Balance         Salary
Country
France    56104.252261   99156.221206
Germany  117872.832977  109465.909160
Spain     61225.397967  104636.270325

In [8]:
#3Ô∏è‚É£ Group by Multiple Columns
#Find the total Balance for each Country and Gender

pivot3 = df.pivot_table(index = ['Country', 'Gender'], values = 'Balance', aggfunc = 'sum')
print(pivot3)

                   Balance
Country Gender
France  Female  5018052.83
        Male    6146693.37
Germany Female  7131160.01
        Male    8310181.11
Spain   Female  3895961.88
        Male    3634762.07

In [10]:
#4Ô∏è‚É£ Using Columns Parameter
#Show Salary distribution across Country and Gender
'''pivot4 = df.pivot_table(values="Salary", index="Country", columns="Gender", aggfunc="mean")
print(pivot4)
'''
pivot4 = df.pivot_table(values = 'Salary', index = 'Country', columns = 'Gender', aggfunc = 'mean')
print(pivot4)

Gender          Female           Male
Country
France   106223.828851   93666.204554
Germany  114906.375667  104868.331831
Spain     98425.288305  110362.019375

In [11]:
#5Ô∏è‚É£ Pivot with Multiple Aggregations
#Find the mean and max Salary per Country
'''pivot5 = df.pivot_table(values="Salary", index="Country", aggfunc=["mean", "max"])
print(pivot5)
'''
pivot5 = df.pivot_table(index = 'Country', values = 'Salary', aggfunc =['min', 'max', 'mean'])
print(pivot5)

             min        max           mean
          Salary     Salary         Salary
Country
France    371.05  199638.56   99156.221206
Germany  2319.96  199725.39  109465.909160
Spain     417.41  199304.74  104636.270325

In [13]:
#6Ô∏è‚É£ Show Salary and Balance using NumOfProducts as Columns
'''pivot6 = df.pivot_table(values=["Salary", "Balance"], index="Country", columns="NumOfProducts", aggfunc="mean")
print(pivot6)
'''
pivot6 = df.pivot_table(columns = 'NumOfProducts', index = 'Country',values = ['Salary', 'Balance'])
print(pivot6)

                     Balance                                        \
NumOfProducts              1              2           3          4
Country
France          81048.214947   31458.441800   79830.400        NaN
Germany        115787.226714  120325.839815  117969.544  124396.09
Spain           97405.355500   28583.095254       0.000        NaN

                     Salary
NumOfProducts             1              2           3         4
Country
France         99589.577684   98636.931000  101846.260       NaN
Germany        99077.452143  125119.844259  100084.024  73860.37
Spain          95319.353667  110041.039153  164669.680       NaN

In [17]:
# Show Balance per Age and Country with NumOfProducts as Columns
'''pivot7 = df.pivot_table(values="Balance", index=["Age", "Country"], columns="NumOfProducts", aggfunc="sum")
print(pivot7)
'''
pivot7 = df.pivot_table(values = 'Balance', index = ['Age', 'Country'], columns = 'NumOfProducts', aggfunc = 'sum')
print(pivot7)

NumOfProducts          1          2   3   4
Age Country
19  Germany     75888.20        NaN NaN NaN
20  Germany          NaN  119714.25 NaN NaN
21  France      98373.26  340244.15 NaN NaN
    Spain      113157.22        NaN NaN NaN
22  France           NaN  174185.98 NaN NaN
...                  ...        ...  ..  ..
73  France      97259.25        NaN NaN NaN
75  Germany          NaN  106307.91 NaN NaN
    Spain            NaN       0.00 NaN NaN
79  France           NaN       0.00 NaN NaN
80  France           NaN       0.00 NaN NaN

[119 rows x 4 columns]

In [19]:
#8Ô∏è‚É£ Find the Balance Trend Over Time
'''pivot8 = df.pivot_table(values="Balance", index="Date", aggfunc="sum")
print(pivot8)
'''
pivot8 = df.pivot_table(index = 'Date', values = 'Balance', aggfunc = 'sum')
print(pivot8)

               Balance
Date
2023-01-01        0.00
2023-01-02        0.00
2023-01-03   159660.80
2023-01-04   159660.80
2023-01-05   125510.82
...                ...
2025-01-27   137946.39
2025-01-28   127892.57
2025-01-29   101084.36
2025-01-30   114754.08
2025-01-31  1581402.46

[427 rows x 1 columns]

In [24]:
#9Ô∏è‚É£ Adding Margins for Total
#Find the average Salary per Country and add a Total row
pivot9 = df.pivot_table(index = 'Country', values = 'Salary', aggfunc = 'mean', margins = True, margins_name = 'Total')
print(pivot9)

                Salary
Country
France    99156.221206
Germany  109465.909160
Spain    104636.270325
Total    103625.570353

In [28]:
#üîü Pivot Table with Multiple Indexes and Columns
#Find Balance and Salary grouped by Country and Gender, split by NumOfProducts
'''pivot10 = df.pivot_table(values=["Balance", "Salary"], index=["Country", "Gender"], columns="NumOfProducts", aggfunc="sum")
print(pivot10)
'''
pivot10 = df.pivot_table(index = ['Country', 'Gender'], values = ['Salary', 'Balance'], columns = 'NumOfProducts', aggfunc = 'sum')
print(pivot10)

                   Balance                                        Salary  \
NumOfProducts            1           2          3          4           1
Country Gender
France  Female  2927119.55  1771611.68  319321.60        NaN  4507227.36
        Male    4772460.87  1374232.50        NaN        NaN  4953782.52
Germany Female  3782137.85  2861697.29  372278.13  115046.74  3452810.60
        Male    4322968.02  3635898.06  217569.59  133745.44  3482611.05
Spain   Female  3172504.50   723457.38       0.00        NaN  2923069.48
        Male    2671816.83   962945.24        NaN        NaN  2796091.74


NumOfProducts            2          3          4
Country Gender
France  Female  4326860.71  407385.04        NaN
        Male    5536832.39        NaN        NaN
Germany Female  2992745.15  329479.91  119346.88
        Male    3763726.44  170940.21   28373.86
Spain   Female  2225343.81  658678.72        NaN
        Male    4267077.50        NaN        NaN

In [29]:
# pivot_table() is completed then next pivot()

In [31]:
# create the new the data for practice pivot() function in data reshaping
import pandas as pd
Data = {"CustomerId": [15634602, 15634602, 15634602, 15737888, 15737888],
       "Name": ["Hargrave", "Hargrave", "Onio", "Mitchell", "Mitchell"],
       "CreditScore": [619, 619, 502, 850, 850],
       "Country": ["France", "France", "France", "Spain", "Spain"],
       "Gender": ["Female", "Female", "Female", "Female", "Female"],"Age": [42, 42, 42, 43, 43],
       "Tenure": [2, 2, 8, 2, 2],
       "Balance": [0, 0, 159660.8, 125510.82, 125510.82],
       "NumOfProducts": [1, 1, 3, 1, 1],
       "Salary": [101348.88, 101348.88, 112542.58, 79084.1, 79084.1],
       "Date": ["01-01-2023", "02-01-2023", "03-01-2023", "04-01-2023", "05-01-2023"],
    "Dep": ["Bank", "Bank", "Bank", "Bank", "Bank"]
       }
dfn = pd.DataFrame(Data)
print(dfn)

   CustomerId      Name  CreditScore Country  Gender  Age  Tenure    Balance  \
0    15634602  Hargrave          619  France  Female   42       2       0.00
1    15634602  Hargrave          619  France  Female   42       2       0.00
2    15634602      Onio          502  France  Female   42       8  159660.80
3    15737888  Mitchell          850   Spain  Female   43       2  125510.82
4    15737888  Mitchell          850   Spain  Female   43       2  125510.82

   NumOfProducts     Salary        Date   Dep
0              1  101348.88  01-01-2023  Bank
1              1  101348.88  02-01-2023  Bank
2              3  112542.58  03-01-2023  Bank
3              1   79084.10  04-01-2023  Bank
4              1   79084.10  05-01-2023  Bank